type Group = Array<[string, string, string]>
export const grouped: Record<string, Group> = {
  "vowelGroup":[
    ["a","あ", "ア"],
    ["i","い", "イ"],
    ["u","う", "ウ"],
    ["e","え", "エ"],
    ["o","お", "オ"]
  ],
  "kGroup":[
    ["ka","か", "カ"],
    ["ki","き", "キ"],
    ["ku","く", "ク"],
    ["ke","け", "ケ"],
    ["ko","こ", "コ"]
  ],
  "gGroup":[
    ["ga","が","ガ"],
    ["gi","ぎ","ギ"],
    ["gu","ぐ","グ"],
    ["ge","げ","ゲ"],
    ["go","ご","ゴ"]
  ],
  "sGroup":[
    ["sa","さ","サ"],
    ["shi","し","シ"],
    ["su","す","ス"],
    ["se","せ","セ"],
    ["so","そ","ソ"]],
  "zGroup":[
    ["za","ざ","ザ"],
    ["ji","じ","ジ"],
    ["zu","ず","ズ"],
    ["ze","ぜ","ゼ"],
    ["zo","ぞ","ゾ"]],
  "tGroup":[
    ["ta","た","タ"],
    ["chi","ち","チ"],
    ["tsu","つ","ツ"],
    ["te","て","テ"],
    ["to","と","ト"]],
  "dGroup":[
    ["da","だ","ダ"],
    ["ji","ぢ","ヂ"],
    ["zu","づ","ヅ"],
    ["de","で","デ"],
    ["do","ど","ド"]],
  "nGroup":[
    ["na","な","ナ"],
    ["ni","に","ニ"],
    ["nu","ぬ","ヌ"],
    ["ne","ね","ネ"],
    ["no","の","ノ"]],
  "hGroup":[
    ["ha","は","ハ"],
    ["hi","ひ","ヒ"],
    ["fu","ふ","フ"],
    ["he","へ","ヘ"],
    ["ho","ほ","ホ"]],
  "bGroup":[
    ["ba","ば","バ"],
    ["bi","び","ビ"],
    ["bu","ぶ","ブ"],
    ["be","べ","ベ"],
    ["bo","ぼ","ボ"]],
  "pGroup":[
    ["pa","ぱ","パ"],
    ["pi","ぴ","ピ"],
    ["pu","ぷ","プ"],
    ["pe","ぺ","ペ"],
    ["po","ぽ","ポ"]],
  "mGroup":[
    ["ma","ま","マ"],
    ["mi","み","ミ"],
    ["mu","む","ム"],
    ["me","め","メ"],
    ["mo","も","モ"]],
  "yGroup":[
    ["ya","や", "ヤ"],
    ["yu","ゆ", "ユ"],
    ["yo","よ", "ヨ"]
  ],
  "rGroup":[
    ["ra","ら", "ラ"],
    ["ri","り", "リ"],
    ["ru","る", "ル"],
    ["re","れ", "レ"],
    ["ro","ろ", "ロ"]
  ],
  "wGroup":[
    ["wa","わ", "ワ"],
    ["wi","ゐ", "ヰ"],
    ["we","ゑ", "ヱ"],
    ["wo","を", "ヲ"],
  ],
  "additional": [
    ["n","ん", "ン"]
  ]
}

export const list = Object.values(grouped).reduce((acc, group) => [...acc, ...group])
